## Production: route53
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 0 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |              NAME              |
|----------|--------------------------------|
| recreate | `aws_route53_record.ca_cdn_NS` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route53_record.ca_cdn_NS must be replaced
-/+ resource "aws_route53_record" "ca_cdn_NS" {
      + allow_overwrite                  = (known after apply)
      ~ fqdn                             = "cdn.design-system.canada.ca.design-system.alpha.canada.ca" -> (known after apply)
      ~ id                               = "Z0225690P46Z6VL70HFE_cdn.design-system.canada.ca_NS" -> (known after apply)
      - multivalue_answer_routing_policy = false -> null
        name                             = "cdn.design-system.canada.ca"
      ~ records                          = [
          - "ns-111.awsdns-13.com",
          - "ns-1114.awsdns-11.org",
          - "ns-2010.awsdns-59.co.uk",
          - "ns-830.awsdns-39.net",
          + "ns-1330.awsdns-38.org",
          + "ns-1608.awsdns-09.co.uk",
          + "ns-386.awsdns-48.com",
          + "ns-955.awsdns-55.net",
        ]
      ~ zone_id                          = "Z0225690P46Z6VL70HFE" -> "Z01332821GEX1H42VB0AM" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

20 tests, 20 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
